# rocks-dev
[dev]
path = "~/Develop/Nvim"


# rocks-config
[config]
auto_setup = true
colorscheme = "sweetie"


# rocks-treesitter
[treesitter]
auto_highlight = "all"
auto_install = "prompt"


# List of non-Neovim rocks.
# This includes things like `toml` or other lua packages.
[rocks]


# List of Neovim plugins to install alongside their versions.
# If the plugin name contains a dot then you must add quotes to the key name!
[plugins]
"rocks.nvim" = "2.43.0"
"rocks-git.nvim" = "2.5.2"
"rocks-dev.nvim" = "1.7.0"
"rocks-edit.nvim" = "scm"
"rocks-lazy.nvim" = "scm"
"rocks-config.nvim" = "3.1.0"
"rocks-treesitter.nvim" = "1.3.0"
"sweetie.nvim" = { version = "3.2.0", colorscheme = "sweetie" }
neorg = { version = "9.1.1", ft = "norg" }
neorg-conceal-wrap = "1.0.1"
"daylight.nvim" = { version = "1.1.0", event = "ColorScheme" }
"telescope.nvim" = { version = "scm", cmd = "Telescope" }
"telescope-file-browser.nvim" = "scm"
# "telescope-zf-native.nvim" = "1.0.0"  # FIXME: can't compile on NixOS
nvim-web-devicons = "0.100"
"numb.nvim" = { version = "scm", event = "CmdlineEnter" }
"zen-mode.nvim" = { version = "1.4.0", cmd = "ZenMode" }
"which-key.nvim" = { version = "2.1.0", pin = true, cmd = "WhichKey" }
"auto-hlsearch.nvim" = { version = "1.1.0", event = "CmdlineEnter" }
"neogit" = { version = "scm", cmd = "Neogit" }
"paperplanes.nvim" = { version = "0.1.6", cmd = "PP" }
"mini.surround" = { version = "0.14.0", event = "DeferredUIEnter" }
nvim-notify = "3.14.1"
rustaceanvim = "5.22.0"
"venn.nvim" = { version = "scm", cmd = "VBox" }
"hlchunk.nvim" = { version = "1.3.0", event = "DeferredUIEnter" }
"twilight.nvim" = "1.0.0"
friendly-snippets = "scm"
nvim-treesitter-legacy-api = "0.9.2"

# tree-sitter parsers
tree-sitter-zig = "scm"
tree-sitter-lua = "scm"
tree-sitter-luadoc = "scm"
tree-sitter-json = "scm"
tree-sitter-toml = "scm"
tree-sitter-fish = "scm"
tree-sitter-html = "scm"
tree-sitter-css = "scm"
tree-sitter-jsdoc = "scm"
tree-sitter-javascript = "scm"
tree-sitter-typescript = "scm"
tree-sitter-vim = "scm"
tree-sitter-elixir = "0.0.36"
tree-sitter-rust = "scm"
tree-sitter-comment = "scm"
tree-sitter-bash = "scm"
tree-sitter-nix = "scm"
tree-sitter-nickel = "scm"
tree-sitter-ecma = "scm"
tree-sitter-just = "scm"
tree-sitter-svelte = "0.0.32"
tree-sitter-sql = "0.0.39"
tree-sitter-kdl = "0.0.29"

# rocks-dev plugins
# "exemplum.nvim" = { dev = true }
# "logging.nvim" = "1.1.0"

[plugins."gitsigns.nvim"]
git = "github:lewis6991/gitsigns.nvim"
rev = "v0.9.0"

[plugins."visual-whitespace.nvim"]
git = "github:mcauley-penney/visual-whitespace.nvim"
rev = "e22d8508a0236f274dde39775ee127c85d30c0c0"
event = "DeferredUIEnter"

[plugins."blink.cmp"]
git = "saghen/blink.cmp"
rev = "v0.9.2"

[plugins."tabline-framework.nvim"]
git = "rafcamlet/tabline-framework.nvim"
rev = "f0d229cc2c103bbc356d26c928eff02be40b230f"

[plugins.nvim-autopairs]
git = "windwp/nvim-autopairs"
rev = "b464658e9b880f463b9f7e6ccddd93fb0013f559"

[plugins.neocord]
git = "iogamaster/neocord"
rev = "587e03390a355e9c364d48638e0e0db2a8431d73"
